import { contactItem } from "./interfaces/interfaces";

export const footerData: contactItem[] = [
  { icon: "phone-icon.png", title: "Телефон", text: "+7 (111) 111-11-11" },
  { icon: "email-icon.png", title: "Почта", text: "test@mail.ru" },
  {
    icon: "location-icon.png",
    title: "Расположение",
    text: "ул. Пушкина, д. 5",
  },
];

export const welcomeData = [
  {
    title: "Добро пожаловать!",
    description:
      "Описание Описание Описание Описание Описание Описание Описание Описание ОписаниеОписание\
         Описание Описание Описание Описание Описание Описание Описание ОписаниеОписание Описание Описание",
  },
  {
    title: "Другой заголовок отеля",
    description:
      "Описание Описание Описание Описание Описание Описание Описание Описание ОписаниеОписание\
         Описание Описание Описание Описание Описание Описание Описание ОписаниеОписание Описание Описание",
  },
];

export const whyWeData = [
  {
    url: "pic-3.jpg",
    text: "Выгодные условия",
  },
  {
    url: "pic-2.jpg",
    text: "Удобное расположение",
  },
];

export const aboutUsData = {
  title: `Туристический отель «DELUX&nbsp;HOUSE»&nbsp;—&nbsp;это:`,
  topics: [
    "более 10 лет узнаваемости на рынке",
    "большая клиентоориентированность",
    "динамичное развитие в соответствии с современными тенденциями",
    "около 300000 посетителей ежегодно",
    "высокопрофессиональная опытная команда из 300 сотрудников, быстро реагирующих на все пожелания гостей и партнеров",
    "заезд в 16.00 / выезд 14.00",
    "17 этажей с номерами разного класса (870 номеров комфорт класса и 31 люкс)",
  ],
};

export const sortingVariants = [
  {
    key: "name",
    value: "name",
    text: "имени",
  },
  {
    key: "price",
    value: "price",
    text: "цене",
  },
  {
    key: "capacity",
    value: "capacity",
    text: "вместимости",
  },
];
